app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "string", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?) RETURNING "id"  [["title", "Hellow"], ["string", nil], ["body", "Hello! I am in Rails!"], ["created_at", "2024-06-24 14:46:27.271542"], ["updated_at", "2024-06-24 14:46:27.271542"]]
---
  def create
    @article = Article.new(article_params)

    if @article.save

SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "articles" SET "body" = ?, "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["body", "I am on Rails!!!"], ["updated_at", "2024-06-24 15:46:06.653840"], ["status", "public"], ["id", 1]]
---
  def update
    @article = Article.find(params[:id])

    if @article.update(article_params)